; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	infrared1 - mode
	thermograph0 - mode
	spectrograph3 - mode
	spectrograph2 - mode
	Star4 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	GroundStation6 - direction
	GroundStation5 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 infrared1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 spectrograph2)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet10)
	(supports instrument3 infrared1)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 spectrograph3)
	(calibration_target instrument4 GroundStation6)
	(supports instrument5 infrared1)
	(supports instrument5 spectrograph2)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation5)
	(calibration_target instrument5 GroundStation6)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(pointing satellite1 Planet10)
	(have_image Phenomenon7 thermograph0)
	(have_image Phenomenon8 infrared1)
	(have_image Star9 thermograph0)
	(have_image Planet10 spectrograph3)
	(have_image Star11 infrared1)
))

)

; plan
1. (turn_to satellite1 groundstation5 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 groundstation5)
   goals met: 0 of 7
2. (switch_on instrument5 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument5)
   goals met: 0 of 7
3. (calibrate satellite1 instrument5 groundstation5)
   added: (calibrated instrument5)
   goals met: 0 of 7
4. (turn_to satellite1 phenomenon7 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 phenomenon7)
   goals met: 0 of 7
5. (turn_to satellite0 groundstation3 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 7
6. (take_image satellite1 phenomenon7 instrument5 thermograph0)
   added: (have_image phenomenon7 thermograph0)
   goals met: 1 of 7
7. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 1 of 7
8. (calibrate satellite0 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 1 of 7
9. (turn_to satellite0 planet10 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet10)
   goals met: 1 of 7
10. (take_image satellite0 planet10 instrument2 spectrograph3)
   added: (have_image planet10 spectrograph3)
   goals met: 2 of 7
11. (turn_to satellite0 groundstation0 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 groundstation0)
   goals met: 3 of 7
12. (turn_to satellite1 phenomenon8 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon8)
   goals met: 3 of 7
13. (take_image satellite1 phenomenon8 instrument5 infrared1)
   added: (have_image phenomenon8 infrared1)
   goals met: 4 of 7
14. (turn_to satellite1 star11 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star11)
   goals met: 4 of 7
15. (take_image satellite1 star11 instrument5 infrared1)
   added: (have_image star11 infrared1)
   goals met: 5 of 7
16. (turn_to satellite1 star9 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star9)
   goals met: 5 of 7
17. (take_image satellite1 star9 instrument5 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 6 of 7
18. (turn_to satellite1 planet10 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 planet10)
   goals met: 7 of 7
